// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Proxy-serverinnstillinger";
HSDTaskDescription = "Skriveren støtter tilkobling til Internett. Hvis du bruker en proxy-server til å koble til Internett, konfigurerer du innstillingene nedenfor.";
TaskDescriptionInAssistantMode = "Skriveren må koble til Internett for å kunne koble til HP Webtjenester. Hvis du bruker en proxy-server til å koble til Internett, skriver du innstillingene nedenfor.\n\nHvis du ikke kjenner proxyinnstillingene, kan du se innstillingene i Nettverksvalg-ruten eller kontakte systemadministratoren.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "En proxy-server er ikke nødvendig for å koble til Internett";
HSDAutomaticProxySettingsTitle = "Automatisk (enheten vil oppdage innstillingene automatisk)";
HSDCustomProxySettingsTitle = "Tilpasset konfigurasjon av proxyserver:";
HSDSystemProxySettingsTitle = "Kopier systeminnstillinger";

// Proxy server settings
HSDProxyServerTitle = "Proxy-server:";
ProxyPortTitle = "Proxyport:";

// Authentication
HSDRequiresAuthenticationButton = "Proxy-server krever autentisering";
HSDUserNameTitle = "Brukernavn:";
HSDPasswordTitle = "Passord:";

HSDApplyNowButtonTitle = "Bruk nå";

// progress titles
UpdateInformationProcessTitle = "Oppdaterer informasjon...";

// alerts
EmptyProxyServerOrPortErrorText = "Både proxy-server og proxy-port må angis.";

EmptyUserNameOrPasswordErrorText = "Proxy-servergodkjenning krever at både brukernavn og passord angis.";

IncorrectProxyServerNameFormatErrorText = "Kunne ikke angi navn på proxy-server. Kontroller om formatet er gyldig.";

HSDUserNameTooLargeErrorText = "Brukernavnet er for langt. Enheten støtter maksimalt %d tegn i et brukernavn.";
